
<#
#̷𝓍   𝓐𝓡𝓢 𝓢𝓒𝓡𝓘𝓟𝓣𝓤𝓜
#̷𝓍   🇵​​​​​🇴​​​​​🇼​​​​​🇪​​​​​🇷​​​​​🇸​​​​​🇭​​​​​🇪​​​​​🇱​​​​​🇱​​​​​ 🇸​​​​​🇨​​​​​🇷​​​​​🇮​​​​​🇵​​​​​🇹​​​​​ 🇧​​​​​🇾​​​​​ 🇬​​​​​🇺​​​​​🇮​​​​​🇱​​​​​🇱​​​​​🇦​​​​​🇺​​​​​🇲​​​​​🇪​​​​​🇵​​​​​🇱​​​​​🇦​​​​​🇳​​​​​🇹​​​​​🇪​​​​​.🇶​​​​​🇨​​​​​@🇬​​​​​🇲​​​​​🇦​​​​​🇮​​​​​🇱​​​​​.🇨​​​​​🇴​​​​​🇲​​​​​
#>


$RootPath = (Resolve-Path "$PSScriptRoot\..").Path
$InitializeScript = (Resolve-Path "$RootPath\scripts\Initialize-LibraryCode.ps1").Path
$TestScript = (Resolve-Path "$RootPath\Template\ps\test.ps1").Path
Write-Host "Generating TEST library source file `"$TestScript`" ... " -f DarkYellow
. "$InitializeScript" "$TestScript"

Push-Location "$RootPath"
./Build.bat
Pop-Location

$PsRunnerAppExe = (Resolve-Path "$RootPath\PsRunnerApp\bin\Release\PsRunnerApp.exe").Path
&"$PsRunnerAppExe"